[
    {
        "title": "Pemex's Deer Park oil refinery scales back operations after fatal accident",
        "link": "https://www.investing.com/news/stock-market-news/pemexs-deer-park-oil-refinery-scales-back-operations-after-fatal-accident-3660742",
        "content": "MEXICO CITY/HOUSTON (Reuters) -Pemex's Deer Park oil refinery near Houston will operate this weekend at a low level following a deadly chemical leak a couple days ago, Mexico's national oil company said in a statement late on Friday.The state-owned oil company said it is continuing to investigate the cause of Thursday's hydrogen sulfide gas leak that killed two contract workers while injuring 35 others during work on a unit at the 312,500-barrel-per-day (bpd) refinery.Work was underway on a sulfur recovery unit at the time, according to people familiar with the matter.Pemex management has operated the facility for nearly three years.The facility is a major motor fuels supplier to Mexico, where the ruling party has sought to reduce reliance on gasoline and diesel imports from non-Pemex refiners in a push to be more energy self-sufficient.On Friday, Pemex's CEO Victor Rodriguez said that thirteen workers remained hospitalized after being exposed to the leak, while Mexico's energy minister said she expected the facility to be back to normal operations later on Friday.But the company walked back that expectation with its latest statement.\"The refinery continues to operate in stable conditions at a low level, a level that will be kept in place during the weekend as long as it's possible to have access to the areas to carry out the corresponding inspections,\" the company said in its Friday night statement.Rodriguez, who took over earlier this month, noted on Friday that three or four units had been shut at the refinery following the incident.The U.S. Chemical Safety and Hazard Investigation Board (CSB), which investigates industrial accidents and makes recommendations to prevent future incidents, also has begun a probe of what it described as a \"very serious incident.\"Deer Park for decades was operated by oil major Shell (LON:SHEL), but Pemex took full ownership of the refinery in early 2022, acquiring Shell's 50% stake in what had been a long-standing joint venture.In 2021, Shell disclosed that it sold its interest in Deer Park to Pemex for some $596 million.Pemex's domestic refineries have for years suffered a series of accidents, including explosions and fires, that have caused deaths in Mexico."
    },
    {
        "title": "Hundreds of Hilton hotel workers walk off the job in Seattle",
        "link": "https://www.investing.com/news/stock-market-news/hundreds-of-hilton-hotel-workers-walk-off-the-job-in-seattle-3660737",
        "content": "(Reuters) -More than a hundred Hilton hotel workers in Seattle have walked off the job calling for higher wages, fair staffing and workloads, and the reversal of COVID-19 era cuts, the Unite Here union said on Saturday.\"The weeklong strikes by 374 workers at the DoubleTree by Hilton Hotel Seattle Airport and Hilton Seattle Airport & Conference Center will last until the early hours of Oct. 19,\" the union said.Hilton did not immediately respond to a Reuters request for comment.A total of over 4,300 hotel workers are now on strike at Hilton, Hyatt, and Marriott hotels in Honolulu, San Diego, San Francisco and Seattle.Around 2,000 workers walked off the job in September at Hilton's largest hotel in the world, the Hilton Hawaiian Village in Honolulu.Some 10,000 U.S. hotel workers began a multi-day strike in several cities during the Labor Day weekend after contract talks with Marriott, Hilton, and Hyatt stalled.Unite Here represents workers in hotels, casinos and airports across the United States and Canada."
    },
    {
        "title": "Verdi union against Commerzbank cross-border merger regardless of bidder nationality",
        "link": "https://www.investing.com/news/stock-market-news/verdi-union-against-commerzbank-crossborder-merger-regardless-of-bidder-nationality-3660735",
        "content": "ROME (Reuters) - German trade union Verdi would oppose a cross-border merger for Commerzbank (ETR:CBKG) even if the bidder was not an Italian bank like UniCredit, an official said on Saturday.Berlin was taken aback by UniCredit's swoop to build a large stake in state-backed Commerzbank, a move the Italian bank says could lead to a merger.Officials told Reuters on Friday that Germany is working to frustrate a possible takeover that could tie Berlin's fortunes to those of heavily indebted Italy.\"(Our opposition) is not due to the fact that (the bidder) is an Italian bank. It could be French or Spanish,\" Frederik Werning, a Verdi labour union official and a member of the Commerzbank Supervisory Board, said in a interview with Italian broadcaster La7.\"When a merger happens every time they say that nothing will change but one out of two times they don't keep their promise and jobs would be lost both in Germany and in Italy\".The merging banks would for at least two years be preoccupied with integration at a time when Germany needs to boost investment, Werning added.\"If the takeover happens, UniCredit and Commerzbank will have to take care of themselves for years and they will no longer be strong partners for their clients, neither in Italy nor in Germany,\" he added.At the heart of Germany's concern is UniCredit's 40 billion euros ($44 billion) holding of Italian government bonds. Commerzbank, which is smaller and financially weaker than UniCredit, also has billions of euros of Italian bonds.($1 = 0.9143 euros)"
    },
    {
        "title": "Google wants US judge's app store ruling put on hold",
        "link": "https://www.investing.com/news/stock-market-news/google-wants-us-judges-app-store-ruling-put-on-hold-3660733",
        "content": "By Mike Scarcella(Reuters) - Google has asked a California federal judge to pause his sweeping court order requiring it to open up its app store Play to greater competition.In a court filing on Friday night, Google said U.S. District Judge James Donato’s injunction order, which goes into effect on Nov. 1, would harm the company and introduce \"serious safety, security, and privacy risks into the Android ecosystem.\"The tech giant, a unit of Alphabet (NASDAQ:GOOGL), asked Donato to stay the order while it pursues an appeal.The judge issued the injunction on Oct. 7 in a case brought by “Fortnite” maker Epic Games, which persuaded a federal jury last year that Google was illegally monopolizing how consumers download apps on Android devices and how they pay for in-app transactions.The judge's order said Google must allow users to download competing third-party Android app platforms or stores and can no longer prohibit the use of competing in-app payment methods. It also bars Google from making payments to device makers to preinstall its app store and from sharing revenue generated from the Play store with other app distributors.If Donato denies Google's bid to put the injunction on hold, the company can ask the San Francisco-based 9th U.S. Circuit Court of Appeals to do so while it appeals the jury's underlying antitrust verdict.Google filed its notice of appeal to the 9th Circuit on Thursday. The appeals court ultimately would be expected to weigh and rule on Google's challenge to Donato's order."
    },
    {
        "title": "Exclusive-Maldives picks Centerview as debt adviser amid financing crunch",
        "link": "https://www.investing.com/news/stock-market-news/exclusivemaldives-picks-centerview-as-debt-adviser-amid-financing-crunch-3660732",
        "content": "By Karin StroheckerLONDON (Reuters) - The Maldives has chosen U.S.-headquartered Centerview Partners to be its adviser on debt matters as the country battles to stave off a financial crisis, two sources familiar with the situation said.Concerns have grown in recent months that the island nation could become the first country to default on Islamic sovereign debt as the government faces a $500-million Sukuk maturing in 2026 and dwindling foreign currency reserves.According to the World Bank, the country's total public and publicly guaranteed debt stood at $8.2 billion, or equivalent to 116% of GDP, in the first quarter of this year.About half of that is external debt, with a big chunk owed to regional rivals China and India, which have extended $1.37 billion and $124 million in loans, respectively, World Bank data shows.Both countries have in recent weeks shored up their support to the Maldives, easing investor concerns about a debt crisis and helping to bolster its international bonds.Beijing signed a financial cooperation agreement with the Maldives in September to strengthen trade and investment. India subscribed to a $50-million Maldives Treasury bill last month and said in October it had approved currency swap deals worth more than $750 million.The Maldives' sole international bond, which had tumbled to 66 cents on the dollar in early September as debt concerns deepened, currently trades around the 80-cents mark, Tradeweb data showed.That is well above the threshold of 70 cents, below which debt is considered distressed.Investment and advisory firm Centerview Partners, founded in 2006, has recently been on a push to increase its sovereign advisory business and has been hiring widely over the past year to beef up its global operations both in Paris and New York.The Maldives' government did not immediately respond to a request for comment."
    },
    {
        "title": "China's BYD expects to swiftly lift sales in Germany, executive tells FAS",
        "link": "https://www.investing.com/news/stock-market-news/chinas-byd-expects-to-swiftly-lift-sales-in-germany-executive-tells-fas-3660731",
        "content": "FRANKFURT (Reuters) - Chinese electric carmaker BYD (SZ:002594) expects to boost sales in Germany within six months, executive vice president Stella Li said in an interview published on Saturday.BYD would gain a foothold in Germany in \"less than half a year,\" Li told the Frankfurter Allgemeine Sonntagszeitung (FAS) newspaper.She criticised European Union tariffs on China-made electric vehicles (EVs) from next month, which Germany had opposed, as a loss for the consumer, adding BYD would start producing cars by the end of 2025 in Hungary.\"I think we will become an important market participant here in Europe,\" she told FAS ahead of the Paris Motor Show, which starts on Oct. 14.German sales teams were being expanded to work on winning over consumer trust as the company's strategy was to establish its presence for the long-term, Li said.She declined to comment on sales targets but indicated that prices would be in a range between 25,000 euros ($27,342) and 30,000 euros each.\"We are still working on our plan,\" she said.Li said in her opinion European carmakers were not competitive because they lacked certainty of a consistent EV policy and were trying to shut out healthy competition.($1 = 0.9143 euros)"
    },
    {
        "title": "Taiwan's China Airlines says no political pressure on new aircraft order",
        "link": "https://www.investing.com/news/stock-market-news/taiwans-china-airlines-says-no-political-pressure-on-new-aircraft-order-3660727",
        "content": "TAIPEI (Reuters) - Taiwan's China Airlines is not facing any political pressure on its decision about whether to buy Boeing (NYSE:BA) or Airbus aircraft for a refreshment of its long-haul fleet, the company's chairman said on Saturday.Taiwan's largest carrier has been weighing Boeing's 777X and the Airbus A350-1000 as replacements for its fleet of 10 Boeing 777-300ERs, mostly used on U.S. and some high-density regional routes, according to industry sources.China Airlines Chairman Hsieh Shih-chien told reporters the company was still in the process of evaluating which aircraft to take and, asked if there was any political pressure on the decision, replied \"no\".\"When it comes to buying aircraft, it is only China Airlines ourselves who makes the assessment. I want to clarify this,\" Hsieh added.Multibillion-dollar deals for new aircraft often have to take political as well as business considerations into account - especially in the case of Taiwan, given its international situation and pressure it faces to give in to China's sovereignty claims, which are rejected by the democratically elected government in Taipei.The United States is Taiwan's most important international backer and arms supplier despite a lack of formal diplomatic ties, and China Airlines' majority owner is the Taiwan government.A senior industry source told Reuters, speaking on condition of anonymity given the sensitivity of the matter, that on the China Airlines deal the timing was a complicating factor given November's U.S. election.In 2022, shortly after then-U.S. House of Representatives Speaker Nancy Pelosi visited Taipei - which set off Chinese war games - China Airlines announced a $4.6 billion order for Boeing's 787 to replace its ageing fleet of Airbus A330s.China Airlines already operates 15 of the smaller Airbus A350-900s, as well as nine of the freighter version of the 777.Hsieh said the 787s would start arriving from next year, while a further 11 Airbus A321s, which are replacing its older Boeing 737-800s, would all come before 2026."
    },
    {
        "title": "How US election could impact CEEMEA equities - JPMorgan",
        "link": "https://www.investing.com/news/stock-market-news/how-us-election-could-impact-ceemea-equities--jpmorgan-3655789",
        "content": "Investing.com - The US election is likely to impact the economies of Central and Eastern Europe, the Middle East and Africa, and JPMorgan discusses the potential consequences.The US investment bank has taken a look at four key policy areas impacted by the US presidential elections - tariffs, the dollar, oil prices and Ukraine - and how those would likely impact CEEMEA equities.Looking at the 60%/10%tariffson China/global on which the Republicans have campaigned, the bank thinks this will limit the volumes of and the pricing power of mid-tech manufactures, like Central Europe and Turkey.Even if direct exports to the US are low from Poland and Turkey, to the extent that Emerging Europe is knitted into the industrial fabric of Europe, we expect the 10% tariff will hurt.However, for commodity exporters, like South Africa and MENA, we think the tariff policy will have little direct impact.On the 2nd round impacts, the 60% China tariff could redirect Chinese exports from the US to the rest of the world - importers, like MENA and South Africa, could be beneficiaries of cheaper Chinese goods that need a new destination.Also, if the EU moves to limit imports from China, then Central Europe and Turkey could gain share in the European manufacturing mix as Chinese products are kept out. However, if the EU does not, then Central Europe and Turkey could lose production/exports as China shifts sales from the US into Europe.Turning to thedollar, a Republican presidential win and tariffs was likely to strengthen the dollar.“A stronger dollar has a straightforward impact on CEEMEA equities: good for USD-pegged MENA / bad for everybody else,” analysts at JPMorgan said, in a note dated Oct. 9.South African equities are probably the most negatively impacted by USD strength followed by Emerging European and then Turkish equities. Historically Turkish equities has been quite sensitive to USD changes, but given the policy changes since July 2016, its correlation to global factors has declined.Looking atoil, JPMorgan analysts said that most investors they have spoken to think Trump is broadly aligned with many GCC foreign policy objectives and that most GCC rulers would welcome a Republican victory … but one key Republican campaign talking point is to bring the overall price level back to pre-COVID levels and cut gasoline prices in half.“We think there is a chance that we could see policy more geared to stable oil prices with some kind of cooperation (either explicit or tacit) with OPEC even at the expense of US production. A small chance, but a chance,” the bank added.A Democratic presidency is likely to continue the existing policies which have allowed US energy production to rise by about 3.8 million barrels per day (total oil liquids) during the Biden Administration.Finally, JPMorgan looks at the relation between Europe, andUkrainein particular, and the US.Trump’s promise to bring a swift halt to the Russia-Ukraine war likely implies accepting Russia’s control over most of Eastern Ukraine. It would tear up the strong post-WW2 consensus that international borders can not be changed by force and contradict the policy of many European and other North American NATO allies.Trump’s potential cessation of Ukrainian military aid would exacerbate the divide between the US and many other NATO alliance members.“We do not know if the new Trump Administration would support using frozen Russian assets to offset the costs of Ukraine’s ongoing defense or its rebuild, nor do we know if the cessation of US aid would come with the cessation of arms sales,” JPMorgan added.A Harris presidency is likely to continue the current policy of ongoing aid to Ukraine with little likely change in the status quo."
    },
    {
        "title": "Secondary valuations remain attractive despite smaller discounts",
        "link": "https://www.investing.com/news/stock-market-news/secondary-valuations-remain-attractive-despite-smaller-discounts-3656304",
        "content": "Investing.com -- According to Wells Fargo analysts in a note Wednesday, secondary valuations in the private equity market have shown resilience, even as discounts have become smaller.The bank said in its investment strategy note that secondary valuations reached their lowest point during the market drawdown in 2022 but have experienced a modest increase through the first half of 2024.Wells Fargo explains that as the likelihood of an economic soft landing increases, the secondary private equity market continues to present attractive opportunities for investors.“The secondary market is typically only available for larger fund stakes and is a common solution for institutional investors looking to rebalance their portfolios,” wrote Wells Fargo.They add that typically, secondary transactions occur for larger fund stakes, providing liquidity options for investors who have committed their capital for the long term, often spanning 6 to 12 years.Wells Fargo highlights that investors in the secondary market can acquire interests at a discount to the fund's current net asset value (NAV).The purchasing strategy is said to offer several advantages, including improved visibility into the underlying portfolio holdings and a shortened path to positive returns.Furthermore, the bank states that as secondary investors often buy these interests after the fund’s investment period, they typically find portfolios that are fully invested and starting to distribute capital as investments are exited.Despite the observed decrease in discounts, the Wells Fargo note indicates that expectations for interest-rate cuts could foster sustained economic expansion. This environment may lead to rising valuations for private equity investments, thereby increasing fund NAVs, according to the firm.Wells Fargo concludes that the current climate remains favorable for secondary investors, combining attractive discounts with an increasing likelihood of a soft landing, which could enhance private equity strategies in the near term"
    },
    {
        "title": "GLP-1 drugs the \"most compelling story in healthcare sector\" - Wells Fargo",
        "link": "https://www.investing.com/news/stock-market-news/glp1-drugs-the-most-compelling-story-in-healthcare-sector--wells-fargo-3655810",
        "content": "Investing.com -- Weight-loss medications like the popular versions made by Denmark'sNovo NordiskA/S (CSE:NOVOb) and US peer Eli Lilly (NYSE:LLY) are the \"most compelling story within the healthcare sector,\" analysts at Wells Fargo said.The GLP-1 class of drugs includes blockbuster brands like Novo's Ozempic and Wegovy and Eli Lilly's Mounjaro and Zepbound.According to Harvard University, GLP-1 treatments aim to help patients with diabetes by helping them release insulin and control blood sugar levels. They can also act on the brain to reduce hunger and delay the emptying of the stomach, possibly leading to weight loss.Since releasing their GLP-1 offerings, both Novo and Eli Lilly have registered record profits. Some analysts have estimated that total annual global sales for such medications could be around $150 billion early in the next decade, Reuters reported.Novo and Eli Lilly have even struggled to keep up with the soaring demand. Because of this shortage, US regulators have allowed businesses, including telehealth groups like Noom and Hims Hers Health (NYSE:HIMS) to make compound versions, or close recreations of brand-name medicines. Shares in WeightWatchers, also known as WW International (NASDAQ:WW), spiked this week after the company announced it would offer a compounded version of Novo's Wegovy.Approximately 74% of adults are considered to be either overweight or obese in the US, with 42% of that group suffering from obesity, the Wells Fargo analysts said in a note to clients this week, citing data from the Centers for Disease Control and Prevention.\"Looking forward, the market for weight-loss drugs should continue expanding rapidly, but we believe cost-benefit economics will be increasingly important,\" the analysts wrote.In particular, they noted that the costs for enrollees in Medicare -- the US federal health insurance program for people aged 65 and older -- are typically far higher for those with obesity than those without such a dianosis. The trend offers \"strong support in the cost-benefit equation for these drugs and will be a critical factor supporting the expanded usage of GLP-1s going forward,\" they added.Meanwhile, demand could further be bolstered by recent clinical data which indicates that GLP-1 drugs may have favorable effects on other health issues like cardiovascular risk, sleep apnea, and dementia, the analysts said.They reiterated a \"neutral\" stance on the overall healthcare sector and a \"favorable\" outlook for the healthcare equipment and supplies, life sciences tools and services, and managed healthcare sub-sectors."
    },
    {
        "title": "Is European Private Equity at turning point, UBS asks",
        "link": "https://www.investing.com/news/stock-market-news/is-european-private-equity-at-turning-point-ubs-asks-3653682",
        "content": "Investing.com - European private equity is at a potentially critical juncture, according to UBS, and the Swiss bank sets out key questions which could determine its future.How quickly will deal volumes recover now that interest rates are falling?Private equity deal activity has begun to improve, but is still at only half the historical average rate. Falling interest rates (lower financing costs) and an economic 'soft landing' should support recovery in activity levels, UBS said.“We expect deal activity to recover from 2022 / 2023 / 1H24 lows, but estimate that Global PE deal values need to double from 1H24 run rate in order to return tomore 'normal' levels. This could be challenging. It could require the PE industry to be more inventive and flexible in the ways it finds to divest assets,” analysts at UBS said, in a note dated Oct. 4.“Trade sales, Secondaries, IPOs could need to be a larger share of exit volumes going forwards, alongside the traditional focus on sales to other financial sponsors. Some acceptance of lower exit valuations might also be a consequence.”Can Private Equity return be sustained at high teens double digit internal rate of return (IRR)?Higher costs of funding, together with any valuation concessions to stimulate deal activity, could reduce overall returns, UBS said.The industry has no benchmark for the achievable returns in a 'normal' interest rate environment, and “we expect the 'best' private equity players will be those that can maintain the highest returns through operational improvement of the businesses they acquire, and identification and execution of bespoke differentiated deals.”Can Private Equity fund raising return to structural growth, with 20-40%\"re-up\" rates?This is entirely possible, the Swiss bank added, although it noted two possible challenges to a rapid return to fundraising growth: if we see lower absolute IRRs this could reduce investor appetite to increase allocations to the sector; and with PE capital call rates >2x distribution rates, it could take time for the over allocation to PE during the recent cashflow hiatus to reverse, making it more difficult for LPs to increase allocations in the near-term.“We estimate that PE distribution rates may need to stay at double the current rate for at least a year for most PE cashflow pacing models to return to neutral positions,” UBS added.Private wealth is an attractive incremental fundraising opportunity, and can it support continued strong growth in assets under management?Given the scale of the Total Addressable Market it seems clear that Private Wealth represents a significant new fund raising opportunity for the industry.However, the current investor debates we are having center on whether it is one that is at least partly required to offset near-term headwinds to institutional LP allocations, fund upsizing and possible fee margin pressure, or whether it is truly an incremental growth driver for the industry."
    },
    {
        "title": "Unpacking the impact of retail investors on Indian markets",
        "link": "https://www.investing.com/news/stock-market-news/unpacking-the-impact-of-retail-investors-on-indian-markets-3651136",
        "content": "Investing.com -- Retail investors have increasingly played a vital role in shaping the Indian stock market, a trend that has deepened over the past decade.While their direct participation in the market has only seen marginal growth—rising from around 8% in 2015 to 9% in 2024—it's the indirect channel of mutual funds that has been the prime beneficiary of this increased retail participation.Domestic Institutional Investors, who manage much of this capital, have seen their market share swell from 11% to 15% over the same period, pushing institutional investment to levels unseen since 2001.This shift toward institutional vehicles is notable because it demonstrates a preference among retail investors for professional management, indicating a cautious but committed approach.Rather than venturing directly into equities, retail investors are entrusting their capital to DIIs, where asset managers allocate investments across various sectors and companies.The collective power of these investors has allowed DIIs to amass substantial holdings across a broader range of companies, particularly in large caps and non-large caps alike.In fact, the concentration of stocks where DIIs hold more than 20% has tripled from 6% in 2015 to nearly 20% in 2024​.In contrast, Foreign Institutional Investors (FIIs) have seen their share of Indian equities shrink, dropping from 21% to 18% over the same timeframe, reflecting the growing prominence of domestic money.This domestic-driven momentum has added a layer of resilience to the Indian market, protecting it from external shocks that once had outsized impacts due to the dominant role of FIIs​.The sectoral choices made by retail investors have evolved notably since 2020. They have reduced exposure to traditionally defensive sectors like staples, healthcare, and real estate while bolstering their investments in technology, utilities, and telecom.Retail portfolios also exhibit a strong preference for small-cap stocks, as opposed to the large-cap focus of institutional investors.This inclination toward smaller, more volatile companies reveals a risk tolerance that contradicts the common stereotype of retail investors being primarily short-term traders.In fact, persistence analysis shows that retail investors are holding on to their investments longer than either DIIs or FIIs, with about 82% of retail portfolios seeing no major churn over a four-year period.Despite this volatility in holdings, retail investors have displayed remarkable performance since 2016. As per analysts at  Bernstein, retail investors have outpaced both DIIs and FIIs, delivering a 1.8% annual outperformance against the market, compared to 0.25% by DIIs and a -1.5% underperformance by FIIs.This success may reflect the contrarian nature of retail investors, who tend to buy when institutional investors are reducing their holdings.For instance, stocks that saw a dip in both DII and FII ownership between 2016 and 2019 posted robust forward returns, and this trend accelerated from 2019 to 2024, with average one-year forward returns of 47%.India's stock market is witnessing a growing influence of retail investors, who are becoming more sophisticated and capable of influencing future market trends.Their preference for small caps, willingness to adopt riskier strategies, and outperformance relative to institutional players have redefined their role from peripheral market participants to pivotal players in India's financial ecosystem.While DIIs have historically been the dominant force, retail investors are now proving to be a dynamic and essential component in the evolution of the Indian stock market."
    },
    {
        "title": "Can the Government save US ecommerce from Temu and Shein?",
        "link": "https://www.investing.com/news/stock-market-news/can-the-government-save-us-ecommerce-from-temu-and-shein-3651084",
        "content": "Investing.com -- The U.S. government is currently grappling with a rising challenge in e-commerce: the growing influence of Chinese retail giants Temu and Shein.Both platforms have disrupted the U.S. market with their ultra-low-cost products and unique consumer-to-manufacturer business models, offering massive price advantages over domestic competitors.With the Biden administration's recent proposals to tighten trade regulations, particularly by targeting the de minimis rule, which allows goods under $800 to enter the U.S. without tariffs, the question arises—can the government actually save U.S. e-commerce from these formidable players?As per analysts from MoffettNathanson, any assumption that regulatory changes will cripple Temu and Shein’s operations is overly optimistic and short-sighted. The de minimis rule, which has been exploited over a billion times annually by Chinese sellers, represents a vital artery for these companies.However, even if the government successfully closes this loophole, MoffettNathanson argues that the companies are unlikely to pack up and leave.Instead, they have been pivoting, increasingly storing goods in U.S. warehouses, ensuring they can maintain swift delivery times, even under stricter trade regulations​.Temu, for instance, has been preemptively stocking its best-selling products locally in the U.S., mitigating potential impacts of the rule change. The report notes that over two-thirds of Temu's most popular items are now located in U.S. warehouses, ensuring fast delivery times of two to four days.This move is not just defensive but strategic, signaling long-term ambitions to further entrench their presence in the U.S. market. Similarly, Shein has been making inroads by establishing warehouses and fulfillment centers in the U.S., further insulating itself from any immediate regulatory shocks.The broader backdrop driving this is China’s slowing domestic consumption and retail growth, forcing its manufacturing base to pivot toward Western markets.MoffettNathanson flags that China’s retail sales growth decelerated sharply from 12% in 2014 to flat in 2022. With a manufacturing base built for global demand, China now views the West as a critical outlet for its vast output of discounted goods.This economic imperative means that even with increased regulatory pressures, Chinese platforms like Temu and Shein will likely continue to find ways to penetrate Western markets.In terms of competition, the proposed regulatory changes may drastically alter the U.S. e-commerce landscape. If Chinese competitors like Temu and Shein are hindered, Etsy (NASDAQ:ETSY) could benefit.Etsy’s customer acquisition costs have skyrocketed as it struggled to compete with aggressive marketing by its Chinese counterparts​. A pullback by Temu and Shein could reduce this pressure, allowing Etsy to regain some of its lost marketing leverage.However, MoffettNathanson warns that Etsy’s advantage would be modest, given that competition from other global players remains fierce.Amazon (NASDAQ:AMZN), on the other hand, appears well insulated from the rise of Temu and Shein. The retail giant has shown resilience, improving its advertising efficiency and reducing referral fees for low-cost items to remain competitive in categories where Temu and Shein have gained ground​.Amazon’s Prime membership, coupled with its unmatched fulfillment capabilities, provides it with a buffer against the pricing pressures posed by Chinese platforms.eBay (NASDAQ:EBAY), which has benefited from the influx of Chinese goods, faces more uncertainty. The platform’s relatively low fees have made it an attractive option for Chinese sellers seeking to minimize costs while accessing U.S. consumers.However, MoffettNathanson’s research suggests that eBay’s exposure to regulatory changes may be less than initially feared. Many of its China-sourced goods, particularly in the lucrative parts and accessories category, are already stored in U.S. warehouses, meaning they wouldn’t be affected by changes to the de minimis rule.Ultimately, while the U.S. government can attempt to curtail the influence of Temu and Shein through regulatory interventions, MoffettNathanson’s analysis suggests that it is unlikely to stop the tide of Chinese goods flooding into the market.Both companies have shown remarkable adaptability, and their deep integration into the U.S. retail landscape makes it improbable that they will simply withdraw in the face of rule changes. Furthermore, China’s economic imperatives ensure that the West will remain a critical destination for its discounted goods."
    },
    {
        "title": "Investing.com stocks of the week",
        "link": "https://www.investing.com/news/stock-market-news/investingcom-stocks-of-the-week-3660432",
        "content": "This week, a number of stocks caught investors' attention with substantial price movements. A couple have made big moves on Friday. Here are Investing.com's stocks of the week:Tesla (NASDAQ:TSLA)On Friday, Tesla shares tumbled following its “Robotaxi Day.” While there was a lot of hype leading up to the event, analysts have seemingly come away disappointed in the lack of details provided by Musk and the company.Morgan Stanley analysts said in a note that there was a “disappointing” lack of detail. “We were overall disappointed with the substance and detail of the presentation. As such, we anticipate TSLA to be under pressure following the event,” added the bank.Oppenheimer analysts said Tesla's event “proved essentially a product release party with limited detail on its software and compute platform and its intended business model outside of vehicle sales.” They also noted there was no update on its low-cost vehicle production plans nor a demonstration of robotaxi or humanoid functionality in challenging conditions.At the time of writing on Friday, Tesla shares are down over 10% in the last week.SMCISMCI shares staged somewhat of a recovery over the past week, climbing around 12%. On Monday, the stock gained more than 15% from last week’s close after the company said it is currently shipping more than 100,000 graphics processors per quarter.SMCI also revealed a new suite of liquid cooling products, sending the company’s shares up following a recent slump.On Tuesday, SMCI also announced the launch of a “new, versatile, high-density infrastructure platform optimized for AI inferencing at the network edge,” while on Thursday, it announced the launch of a new series of servers, GPU-accelerated systems, and storage servers.China StocksThe recent financial stimulus measures announced by China triggered a shortlived bounce for equities in the country as Chinese stocks fell this week. Traders now seem to be hoping the Beijing government announces new measures this weekend.In a note this week, analysts at MRB Partners said China’s earnings outlook still remained muted, and it was too soon to upgrade local stocks.China’s recent rally was driven chiefly by “unrealistic expectations” of government stimulus said the firm. They believe that while the country’s economic outlook was positive, it did not extend into corporate earnings.Furthermore, MRB said any upgrades to Chinese stocks are “predicated on a broad-based earnings recovery” and that “no evidence for such a recovery is yet apparent.”Microstrategy (NASDAQ:MSTR)Microstrategy shares surged this week, rising around 23%. Much of that move came on Friday, with MSTR up more than 12% after the company said it plans to become aBitcoinbank.Michael Saylor is said to have told analysts at Bernstein that the company’s plan is to be the leading Bitcoin bank. “Bitcoin is going to go to millions a coin, you know, and then we create a trillion-dollar company,” Saylor reportedly told Bernstein in an interview.Even prior to the comments from Saylor, Microstrategy had been performing well. For the year-to-date, the stock has surged more than 200%."
    },
    {
        "title": "Bain makes binding offer for Fuji Soft, 7% higher than rival KKR",
        "link": "https://www.investing.com/news/stock-market-news/bain-makes-binding-offer-for-fuji-soft-7-higher-than-rival-kkr-3660703",
        "content": "TOKYO (Reuters) -U.S. buyout fund Bain Capital made a binding offer to buy Fuji Soft for 9,450 yen a share in a deal that values the Japanese software developer at $4 billion and outbids rival KKR by about 7%.Bain said in a statement on Friday it planned to launch the offer late this month if it can get Fuji Soft's backing.Bain and KKR have been engaged in a rare showdown to take over the Yokohama-based informational technology firm, which has been at odds with some of its major shareholders.KKR last month brought forward the start of its tender offer by about a week at the unchanged price of 8,800 yen, and said it would conduct the tender offer in two stages.Fuji Soft has since said its board had decided to recommend shareholders to tender shares to KKR's first tender offer.Following Bain's Friday announcement, KKR said its offer was superior and in the best interest of Fuji Soft and all of its stakeholders.\"KKR has a demonstrated track record of collaborating with management teams and employees and unlocking growth for Japanese companies, which contributed to the reasons the board of Fuji Soft has twice recommended and supported our offer,\" a KKR spokesperson said in an emailed statement.Shares in Fuji Soft closed at 9,000 yen on Friday.($1 = 149.1200 yen)"
    }
]